a =[386,36000]

if a[0] == 186:
    if a[1] <= 186 :
        print("通話費為:",a[1]*0.09)
    elif a[1] < a[0]*2:
        print("通話費為:",a[1]*0.09*0.9) 
    elif a[1] > a[0]*2:
        print("通話費為:",a[1]*0.09*0.8)
elif a[0] == 386:
    if a[1] <= 386 :
        print("通話費為:",a[1]*0.08)
    elif a[1] < a[0]*2:
        print("通話費為:",a[1]*0.08*0.8)
    elif a[1] > a[0]*2:
        print("通話費為:",a[1]*0.08*0.7)
elif a[0] == 586:
    if a[1] <= 586 :
        print("通話費為:",a[1]*0.07)
    elif a[1] < a[0]*2:
        print("通話費為:",a[1]*0.07*0.7)
    elif a[1] > a[0]*2:
        print("通話費為:",a[1]*0.07*0.6)
elif a[0] == 986:
    if a[1] <= 986 :
        print("通話費為:",a[1]*0.06)
    elif a[1] < a[0]*2:
        print("通話費為:",a[1]*0.06*0.6)
    elif a[1] > a[0]*2:
        print("通話費為:",a[1]*0.06*0.5)
else:
    print("無此費率")